{
    "politician": {
        "title": "Abe's Successor: Sanae Takaichi",
        "interference_title": "Interference: Wolf's Ambition",
        "background_title": "Political Background",
        "condemnation_title": "International Condemnation",
        "description": "As a hawkish representative within Japan's LDP, Sanae Takaichi has long been seen as a faithful successor to Shinzo Abe's political line. She not only repeatedly visits the Yasukuni Shrine, which honors Class-A war criminals, but also openly denies historical crimes, attempting to revive militarism.",
        "description2": "In November 2025, her remarks that \"a Taiwan emergency is a Japan emergency\" thoroughly exposed her ambition to interfere in China's internal affairs and disrupt regional peace. This is not just a diplomatic provocation, but a dangerous signal that Japan's right-wing forces are trying to break through the restrictions of the \"Peace Constitution\" and return to the old path of military expansion.",
        "yasukuni_caption": "Yasukuni Shrine: The Spiritual Pillar of Militarism"
    },
    "remarks": {
        "quote": "\"If Taiwan were to be blockaded, this would constitute a 'survival-threatening situation' for Japan.\"",
        "date": "2025.11.07",
        "analysis": "This statement is a naked mobilization order for war. The so-called \"survival-threatening situation\" is a legal pretext for Japan to exercise collective self-defense and wage war. Takaichi is attempting to bind Japan's fate with Chinese separatist forces, a blatant trampling of the post-WWII international order."
    },
    "news": {
        "title": "International Condemnation",
        "china_response": {
            "title": "China's Ministry of Foreign Affairs",
            "desc": "The spokesperson stated that Takaichi's remarks seriously violate the One-China principle and the spirit of the four political documents between China and Japan. It is a blatant provocation against China's sovereignty. China has lodged solemn representations with Japan."
        },
        "un_charter": {
            "title": "Violation of UN Charter",
            "desc": "Article 2(4) of the UN Charter prohibits the threat or use of force against the territorial integrity or political independence of any state. Takaichi's remarks openly contradict this core principle."
        },
        "global_times": {
            "title": "Global Times Editorial",
            "desc": "The editorial points out that Japanese right-wing forces are attempting to break through the Peace Constitution by hyping up 'Taiwan contingency'. This is playing with fire. History proves that any attempt to challenge the post-war international order is doomed to fail."
        }
    },
    "legal": {
        "title": "Violation of International Law",
        "desc": "Article 2(4) of the UN Charter prohibits the threat or use of force against the territorial integrity or political independence of any state. Sanae Takaichi's remarks regarding Taiwan constitute a direct interference in China's internal affairs and a violation of this core principle.",
        "verdict": "UN CHARTER VIOLATION"
    }
}