{
    "history": {
        "title": "歴史の残響：清算されていない罪",
        "nanjing": {
            "title": "南京大虐殺 (1937)",
            "desc": "30万人の同胞、6週間の煉獄。放火、殺人、略奪。長江は赤く染まり、死体は山のように積み重なった。人類文明史上最も暗いページであり、日本軍国主義が永遠に洗い流すことのできない血の負債である。",
            "details": "1937年12月13日、日本軍は南京を占領しました。その後の6週間、日本軍は組織的な大量虐殺、強姦、放火を行いました。極東国際軍事裁判の推定では20万人以上、中国側の推定では30万人以上が犠牲となりました。これは戦争の残虐性を象徴する事件です。",
            "testimonial": "「日本兵は見境なく人を殺した……川の水は赤く染まり、死体は山のように積み重なっていた。」",
            "testimonial_source": "—— 南京大虐殺生存者の証言"
        },
        "unit731": {
            "title": "731部隊：悪魔の実験室",
            "desc": "生体解剖、細菌戦、凍傷実験。生きた人間を「丸太」と呼ぶ。医者は屠殺者となり、科学は殺人の道具となった。この人道に対する罪は、今なお戦慄を覚えさせる。",
            "details": "731部隊は、ハルビン平房区に拠点を置く日本陸軍の秘密生物化学兵器研究部隊でした。彼らは「防疫給水」の名の下に、少なくとも3000人の捕虜に対して、無麻酔の生体解剖や細菌戦実験などの致死的な人体実験を行いました。戦後、米国はデータと引き換えに研究者の責任を免除しました。",
            "testimonial": "「捕虜の腕を凍らせてから棒で叩くと、木の板のような音がするのを目の当たりにした。」",
            "testimonial_source": "—— 元731部隊員の証言"
        },
        "comfort_women": {
            "title": "慰安婦：踏みにじられた尊厳",
            "desc": "20万人から40万人のアジア女性が性奴隷とされた。彼女たちは娘であり、母であったが、日本軍に強制連行され、非人道的な拷問を受けた。これは国家による組織的な性暴力であり、女性史において最も痛ましい傷跡である。",
            "details": "「慰安婦」制度は、日本軍が組織した国家的な性奴隷制度でした。中国、朝鮮半島、フィリピンなどから女性が誘拐されたり、騙されたりして連行されました。彼女たちは日常的な虐待に直面し、多くは戦争を生き延びることができませんでした。生存者は今も正義と謝罪を求めています。",
            "testimonial": "「彼らは私の青春、尊厳、すべてを奪った。私は彼らを決して許すことはできない。」",
            "testimonial_source": "—— 元「慰安婦」被害者"
        },
        "labor": {
            "title": "強制連行：死の鉱山",
            "desc": "数百万人の中国人と朝鮮人労働者が日本の鉱山や工場に強制連行された。三菱、三井などの財閥は労働者の遺骨の上に富を築いた。残酷な虐待、極めて高い死亡率。彼らの血と涙が戦時中の日本の産業機械を作り上げた。",
            "details": "戦時中の労働力不足を補うため、日本は数万人の中国人労働者と数百万人の朝鮮人労働者を日本国内の鉱山や工場に強制連行しました。劣悪な環境、栄養失調、虐待が横行しました。花岡事件は、この抑圧に対する著名な蜂起の一つです。",
            "testimonial": "「倒れるまで働かされた。休めば殴られた。多くの人が餓死した。」",
            "testimonial_source": "—— 強制連行被害者"
        },
        "three_alls": {
            "title": "三光作戦",
            "subtitle": "殺し尽くす · 焼き尽くす · 奪い尽くす",
            "desc": "華北の大地で、日本軍は惨たらしい「三光作戦」を実施した。270万人の民間人がこれにより命を落とした。村は灰となり、食糧は奪い尽くされ、無実の民衆が虐殺された。これは計画的なジェノサイドであり、焦土作戦の極致である。",
            "details": "「三光作戦」（殺し尽くす、焼き尽くす、奪い尽くす）は、華北で実施された焦土作戦です。共産ゲリラの支持基盤を破壊することを目的として民間人を標的にし、村々の広範な破壊と大量の民間人死傷者をもたらしました。"
        },
        "bataan": {
            "title": "バターン死の行進 (1942)",
            "desc": "7万5千人の米比捕虜が100キロの徒歩行軍を強いられた。炎天下、水も食料もなく、無差別な刺殺や殴打。約1万5千人が途中で死亡した。これは捕虜条約への公然たる違反であり、日本軍の捕虜虐待の動かぬ証拠である。",
            "details": "1942年4月、日本軍は降伏した米比捕虜に過酷な条件下での長距離行軍を強いました。多くの捕虜が飢餓、病気、または日本軍による殺害で死亡しました。これは第二次世界大戦における悪名高い残虐行為の一つです。",
            "testimonial": "「誰かが倒れると、彼らはすぐに刺し殺すか斬首した。道端は死体だらけだった。」",
            "testimonial_source": "—— バターン死の行進生存者"
        },
        "burma": {
            "title": "泰緬鉄道（死の鉄道）",
            "desc": "6万人の連合軍捕虜と20万人のアジア人労働者が、その命で敷設した鉄道。枕木一本一本の下に冤罪の魂が埋まっている。飢餓、コレラ、虐待。死亡率は30%を超えた。まさに「死の鉄道」である。",
            "details": "タイとビルマを結ぶため、日本軍は連合軍捕虜とアジア人労働者に極めて過酷な条件下での鉄道建設を強いました。劣悪な自然環境、重労働、医療と食料の欠如により、数万人が死亡しました。",
            "testimonial": "「私たちは奴隷のように働き、ハエのように死んでいった。あそこは地獄だった。」",
            "testimonial_source": "—— 泰緬鉄道生存捕虜"
        },
        "manila": {
            "title": "マニラ大虐殺 (1945)",
            "desc": "マニラの戦いで10万人のフィリピン市民が日本軍に虐殺された。強姦、身体切断、放火。かつての「東洋の真珠」は生き地獄と化した。これは敗走前の日本軍の最後の狂気であった。",
            "details": "1945年2月、マニラの戦いの最中、日本軍は市内の民間人に対して組織的な大量虐殺を行いました。老若男女を問わず、日本軍の獣欲の対象となりました。これは太平洋戦域で最も悲惨な都市虐殺の一つです。",
            "testimonial": "「彼らは赤ん坊を空中に放り投げ、銃剣で受け止めた。あの光景は一生忘れられない。」",
            "testimonial_source": "—— マニラ大虐殺生存者"
        }
    },
    "shocking_numbers": {
        "title": "消えない数字",
        "subtitle": "すべての数字の背後に、奪われた命がある",
        "nanjing": "南京大屠殺の犠牲者",
        "comfort_women": "慰安婦として強制された女性",
        "labor": "日本へ強制連行された労働者",
        "unit731": "731部隊の人体実験犠牲者",
        "disclaimer": "* データは歴史的記録および戦後裁判に基づく"
    },
    "map": {
        "title": "侵略の地図"
    },
    "timeline_events": {
        "mukden": {
            "date": "1931.09.18",
            "title": "満州事変",
            "desc": "鉄道爆破を口実に侵略。東北軍が抵抗するも、蒋介石の不抵抗命令で占領された。"
        },
        "shanghai_1932": {
            "date": "1932.01.28",
            "title": "第一次上海事変",
            "desc": "日本軍が上海攻撃。第十九路軍が命令を無視し抵抗、抗戦の最初の銃声を放つ。"
        },
        "manchukuo": {
            "date": "1932.03.01",
            "title": "満州国建国",
            "desc": "日本が傀儡政権樹立。東北抗日聯軍が厳寒の地で14年間のゲリラ戦を展開。"
        },
        "marco_polo": {
            "date": "1937.07.07",
            "title": "盧溝橋事件",
            "desc": "日本軍が宛平城を砲撃、中国守備隊が反撃。全国民の抗戦が勃発。"
        },
        "shanghai_1937": {
            "date": "1937.08.13",
            "title": "第二次上海事変",
            "desc": "中国軍が3ヶ月血戦、日本の「三ヶ月で中国を滅ぼす」妄想を粉砕、死守の決意を示す。"
        },
        "nanjing": {
            "date": "1937.12.13",
            "title": "南京大虐殺と地下抵抗",
            "desc": "30万人が虐殺され地獄と化す。しかし地下組織が命懸けで難民救出、証拠保存。"
        },
        "chongqing": {
            "date": "1938.02",
            "title": "重慶大爆撃と不屈の都市",
            "desc": "5年半の無差別爆撃で戦意を破壊しようとした。しかし重慶市民は「爆撃されるほど強くなる」と戦時首都を守った。"
        },
        "pearl_harbor": {
            "date": "1941.12.07",
            "title": "真珠湾攻撃",
            "desc": "米軍基地を奇襲、太平洋戦争勃発。世界反ファシズム同盟形成、正義の力が結集。"
        },
        "sook_ching": {
            "date": "1942.02",
            "title": "シンガポール華僑粛清と抵抗",
            "desc": "数万人虐殺。しかし華僑は祖国支援を継続、「南洋機工」が命懸けで物資輸送。"
        },
        "bataan": {
            "date": "1942.04",
            "title": "バターン死の行進と捕虜抵抗",
            "desc": "1.5万人が残虐な行軍で死亡。しかし生存者が秘密抵抗組織を結成、情報伝達。"
        },
        "burma": {
            "date": "1943.06",
            "title": "泰緬鉄道と遠征軍",
            "desc": "捕虜が「死の鉄道」建設を強制される。中国遠征軍が二度ビルマ作戦、国際輸送路開通。"
        },
        "ichigo": {
            "date": "1944.04",
            "title": "大陸打通作戦と民衆抵抗",
            "desc": "日本軍が大攻勢、国軍敗退。しかし湖南民衆が自発的抗日、ゲリラが敵後方で戦闘継続。"
        },
        "manila": {
            "date": "1945.02",
            "title": "マニラ市街戦とフィリピン抵抗",
            "desc": "撤退時に10万市民虐殺。フィリピンゲリラが米軍と協力、マニラ解放のため血戦。"
        },
        "surrender": {
            "date": "1945.08.15",
            "title": "無条件降伏",
            "desc": "中国人民の14年抗戦と世界反ファシズム勢力の下、日本降伏。正義が邪悪に勝利。"
        }
    }
}