{
    "history": {
        "title": "歴史の残響：清算されていない罪",
        "nanjing": {
            "title": "南京大虐殺 (1937)",
            "desc": "30万人の同胞、6週間の煉獄。放火、殺人、略奪。長江は赤く染まり、死体は山のように積み重なった。人類文明史上最も暗いページであり、日本軍国主義が永遠に洗い流すことのできない血の負債である。",
            "details": "1937年12月13日、日本軍は南京を占領しました。その後の6週間、日本軍は組織的な大量虐殺、強姦、放火を行いました。極東国際軍事裁判の推定では20万人以上、中国側の推定では30万人以上が犠牲となりました。これは戦争の残虐性を象徴する事件です。"
        },
        "unit731": {
            "title": "731部隊：悪魔の実験室",
            "desc": "生体解剖、細菌戦、凍傷実験。生きた人間を「丸太」と呼ぶ。医者は屠殺者となり、科学は殺人の道具となった。この人道に対する罪は、今なお戦慄を覚えさせる。",
            "details": "731部隊は、ハルビン平房区に拠点を置く日本陸軍の秘密生物化学兵器研究部隊でした。彼らは「防疫給水」の名の下に、少なくとも3000人の捕虜に対して、無麻酔の生体解剖や細菌戦実験などの致死的な人体実験を行いました。戦後、米国はデータと引き換えに研究者の責任を免除しました。"
        },
        "comfort_women": {
            "title": "慰安婦：踏みにじられた尊厳",
            "desc": "20万人から40万人のアジア女性が性奴隷とされた。彼女たちは娘であり、母であったが、日本軍に強制連行され、非人道的な拷問を受けた。これは国家による組織的な性暴力であり、女性史において最も痛ましい傷跡である。",
            "details": "「慰安婦」制度は、日本軍が組織した国家的な性奴隷制度でした。中国、朝鮮半島、フィリピンなどから女性が誘拐されたり、騙されたりして連行されました。彼女たちは日常的な虐待に直面し、多くは戦争を生き延びることができませんでした。生存者は今も正義と謝罪を求めています。"
        },
        "labor": {
            "title": "強制連行：死の鉱山",
            "desc": "数百万人の中国人と朝鮮人労働者が日本の鉱山や工場に強制連行された。三菱、三井などの財閥は労働者の遺骨の上に富を築いた。残酷な虐待、極めて高い死亡率。彼らの血と涙が戦時中の日本の産業機械を作り上げた。",
            "details": "戦時中の労働力不足を補うため、日本は数万人の中国人労働者と数百万人の朝鮮人労働者を日本国内の鉱山や工場に強制連行しました。劣悪な環境、栄養失調、虐待が横行しました。花岡事件は、この抑圧に対する著名な蜂起の一つです。"
        },
        "three_alls": {
            "title": "三光作戦",
            "subtitle": "殺し尽くす · 焼き尽くす · 奪い尽くす",
            "desc": "華北の大地で、日本軍は惨たらしい「三光作戦」を実施した。270万人の民間人がこれにより命を落とした。村は灰となり、食糧は奪い尽くされ、無実の民衆が虐殺された。これは計画的なジェノサイドであり、焦土作戦の極致である。",
            "details": "「三光作戦」（殺し尽くす、焼き尽くす、奪い尽くす）は、華北で実施された焦土作戦です。共産ゲリラの支持基盤を破壊することを目的として民間人を標的にし、村々の広範な破壊と大量の民間人死傷者をもたらしました。"
        }
    },
    "shocking_numbers": {
        "title": "消えない数字",
        "subtitle": "すべての数字の背後に、奪われた命がある",
        "nanjing": "南京大屠殺の犠牲者",
        "comfort_women": "慰安婦として強制された女性",
        "labor": "日本へ強制連行された労働者",
        "unit731": "731部隊の人体実験犠牲者",
        "disclaimer": "* データは歴史的記録および戦後裁判に基づく"
    },
    "map": {
        "title": "罪悪の地図"
    }
}